# 1. คํานวณเปอร์เซ็นของจํานวนนักเรียนที่สอบผ่านจากจํานวนนักเรียนทั้งหมดในห้อง โดยเราจะกรอกข้อมูลจํานวนนักเรียนทั้ง 2 อย่าง มาให้โปรแกรมใช้ต่อ

# นักเรียนทั้งหมด (คน) : 40
# สอบผ่าน (คน) : 28
# สอบผ่าน 70 %

import math
std:int = int(input('นักเรียนทั้งหมด (คน) : '))
std_pass:int = int(input('สอบผ่าน (คน) : '))
print(f'สอบผ่าน {math.floor((100 * std_pass) / std)} %')

# 3. คํานวณความยาวด้านตรงข้ามมุมฉากของสามเหลี่ยมมุมฉาก โดยเราจะกรอกข้อมูลความยาวด้าน a กับ b มาให้โปรแกรมใช้ต่อ (รับค่าเป็นเลขทศนิยม) โดยสมการความสัมพันธ์ของความยาวด้านสามเหลี่ยมมุมฉากคือ c^2 = a^2 + b^2 ซึ่ง c คือความยาวด้านตรงข้ามมุมฉาก

# a : 3
# b : 4
# c = 5

import math
a:float = float(input('a : '))
b:float = float(input('b : '))
print(f'c = {math.floor(math.sqrt(a**2 + b**2))}')

# 6. คํานวณปริมาตรทรงลูกบาศก์โดยเราจะกรอกความยาวด้าน มาให้โปรแกรมใช้ต่อ
# ตัวอย่างผลลัพธ์
# ความยาวด้าน : 4
# ปริมาตรทรงลูกบาศก์ = 64

side_length:int = int(input('ความยาวด้าน : '))
print(f'ปริมาตรทรงลูกบาศก์ = {side_length ** 3}')

# 8. ตรวจสอบอายุผู้ใช้งานว่าสามารถเข้าเล่นแอพของเราได้รึป่าว ผู้ใช้งานที่อายุต่ํากว่า 18 ปี จะเข้าเล่นแอพไม่ได้ โดยเราจะกรอกข้อมูลชื่อผู้ใช้งาน และอายุผู้ใช้งาน มาให้โปรแกรมใช้ต่อ

# ชื่อ : ศักรินทร์
# อายุ : 25
# คุณ ศักรินทร์ , เข้าเล่นแอพได้ = True

name_user = input('ชื่อ : ')
age_user = int(input('อายุ : '))
pass_user = "true" if age_user > 18 else "false" 
print(f'คุณ {name_user} , เข้าเล่นแอพได้ = {pass_user}')

# 9. ตรวจสอบชนิดยานพาหนะว่ามีในโชว์รูมรึป่าว ยานพาหนะที่มีในโชว์รูมได้แก่ “รถยนต์” , “มอเตอร์ไซค์” , “สิบล้อ” โดยเราจะกรอกข้อมูลชื่อยานพาหนะมาให้โปรแกรมใช้ต่อ

# สนใจคันไหน : สิบล้อ
# ผลการตรวจสอบ = True

# สนใจคันไหน : มอเตอร์ไซร้
# ผลการตรวจสอบ = False

car_name = input('สนใจคันไหน : ')
result = car_name == 'รถยนต์' or car_name ==  'มอเตอร์ไซค์' or car_name == 'สิบล้อ'
print(f'ผลการตรวจสอบ = {result}')

# 14. แสดงผลการตรวจสอบว่าตัวเลขเป็นเลขคี่หรือไม่ โดยเราจะกรอกตัวเลขมาให้โปรแกรมใช้งานต่อ
# ตัวอย่างผลลัพธ์
# ตัวเลข : 4
# เป็นเลขคี่ = False

num = int(input('ป้อนตัวเลข: '))
print(f'เป็นเลขคี่ = {False if num%2 == 0 else "true"}')

# 15. ตรวจสอบว่าตัวเลข 2 ตัว เป็นเลขคู่ทั้งคู่ หรือเป็นเลขคี่ทั้งคู่ หรือไม่ โดยเราจะกรอกตัวเลขทั้ง 2 ตัว มาให้โปรแกรมใช้งานต่อ
# ตัวอย่างผลลัพธ์
# ตัวเลข 1 : 7
# ตัวเลข 2 : 8
# ผลการตรวจสอบ = False

num1 = int(input('ป้อนตัวเลข 1: '))
num2 = int(input('ป้อนตัวเลข 2: '))
result = (num1%2 == 0 and num2%2 == 0) or (num1%2 != 0 and num2%2 != 0)
print(f'ตัวเลข 1 : {num1}')
print(f'ตัวเลข 1 : {num2}')
print(f'ผลการตรวจสอบ = {result}')

# 16. แสดงผลการตรวจสอบว่าตัวเลขอยู่ระหว่าง 0 ถึง 100 หรือไม่ โดยเราจะกรอกตัวเลขมาให้โปรแกรมใช้งานต่อ
# ตัวอย่างผลลัพธ์
# ตัวเลข : 55
# อยู่ในช่วง 0-100 = True

num = int(input('ป้อนตัวเลข: '))
result = 0 <= num <= 100
print(f'อยู่ในช่วง 0-100 = {result}')

# 18. ตรวจสอบการบันทึกโน้ต ว่าหัวข้อและคําอธิบายที่กรอกมาไม่ใช่ข้อความว่างทั้งคู่
# ตัวอย่างผลลัพธ์ 1
# หัวข้อ : สวัสดี
# คําอธิบาย : เรามาอย่างสันติ
# ไม่มีข้อความว่าง = True

# ตัวอย่างผลลัพธ์ 2
# หัวข้อ : ทําไมถึงมาสาย
# คําอธิบาย :
# ไม่มีข้อความว่าง = False

title = input('หัวข้อ: ')
description = input('คําอธิบาย: ')
is_empty = title != '' and description != ''
print(f'หัวข้อ: {title}')
print(f'คําอธิบาย: {description}')
print(f'ไม่มีข้อความว่าง: {is_empty}')




