# 1. คํานวณเปอร์เซ็นของจํานวนนักเรียนที่สอบผ่านจากจํานวนนักเรียนทั้งหมดในห้อง โดยเราจะกรอกข้อมูลจํานวนนักเรียนทั้ง 2 อย่าง มาให้โปรแกรมใช้ต่อ

# นักเรียนทั้งหมด (คน) : 40
# สอบผ่าน (คน) : 28
# สอบผ่าน 70 %

# import math
# std:int = int(input('นักเรียนทั้งหมด (คน) : '))
# std_pass:int = int(input('สอบผ่าน (คน) : '))
# print(f'สอบผ่าน {math.floor((100 * std_pass) / std)} %')

# 3. คํานวณความยาวด้านตรงข้ามมุมฉากของสามเหลี่ยมมุมฉาก โดยเราจะกรอกข้อมูลความยาวด้าน a กับ b มาให้โปรแกรมใช้ต่อ (รับค่าเป็นเลขทศนิยม) โดยสมการความสัมพันธ์ของความยาวด้านสามเหลี่ยมมุมฉากคือ c^2 = a^2 + b^2 ซึ่ง c คือความยาวด้านตรงข้ามมุมฉาก

# a : 3
# b : 4
# c = 5

# import math
# a:float = float(input('a : '))
# b:float = float(input('b : '))
# print(f'c = {math.floor(math.sqrt(a**2 + b**2))}')

# 6. คํานวณปริมาตรทรงลูกบาศก์โดยเราจะกรอกความยาวด้าน มาให้โปรแกรมใช้ต่อ
# ตัวอย่างผลลัพธ์
# ความยาวด้าน : 4
# ปริมาตรทรงลูกบาศก์ = 64

side_length:int = int(input('ความยาวด้าน : '))
print(f'ปริมาตรทรงลูกบาศก์ = {side_length ** 3}')
